In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

from collections import defaultdict

from model.Base import Base
from model.Device import Device
from model.DeviceAppTraffic import DeviceAppTraffic
from model.DnsReq import DnsReq
from model.Flow import Flow
from model.User import User
from model.user_devices import user_devices

from sqlalchemy import create_engine, text, func
from sqlalchemy.orm import sessionmaker
from sqlalchemy.pool import NullPool

from IPython.display import display

#output_notebook()

DB='postgresql+psycopg2:///ucnstudy'

engine = create_engine(DB, echo=False, poolclass=NullPool)
Base.metadata.bind = engine
Session = sessionmaker(bind=engine)

Analyze device usage per user

In [1]:
ses = Session()

users = ses.query(User)

for user in users:
    sql_user_devices = text('select * from user, user_devices where user_devices.user_id =:user').bindparams(user = user.id)
    user_devices = ses.execute(sql_user_devices)

    print ("user: " + str(user.id))
    for devices in user_devices:
        sql_domains_accessed = text('select dnsreqs.query_domain, count(*) from dnsreqs, user_devices where dnsreqs.devid =:devid group by dnsreqs.query_domain').bindparams(devid = devices.device_id)
        domains_accessed = ses.execute(sql_domains_accessed)
    print ("device: " + str(devices.device_id))
        dom = []
        accesses = []
        length = 0
        for domains in domains_accessed:
            #print (domains.query_domain, domains.count)
            dom.append(domains.query_domain)
            accesses.append(domains.count)
            length = length + 1
        x = np.arange(length)
        plt.bar(x, accesses)
        #plt.xticks(x + 0.5, dom, rotation = 90)
        plt.show()

IndentationError: unexpected indent (<ipython-input-1-4f870915f7f6>, line 14)

Analizing beginning and end of daily activities

In [2]:
ses = Session()

devices = ses.query(Device).distinct().order_by(Device.id)

for dev in devices: 
    
    sql_beg_day = text("SELECT distinct devid, flows.startts FROM flows join (SELECT DATE(startts) as date_entere\
d, MIN(startts) as min_time FROM flows WHERE devid =:d_id GROUP BY date(startts)) AS grp ON grp.min_ti\
me = flows.startts order by flows.startts limit 400;").bindparams(d_id = dev.id)
    result_beg_day = ses.execute(sql_beg_day)
    
    info = defaultdict(list)
    for row in result_beg_day:
        info['devid'].append(str(row[0]))
        info['start'].append(row[1])
        
    sql_end_day = text("SELECT DISTINCT devid, flows.endts FROM flows join (SELECT DATE(endts) as date_entered, M\
AX(endts) as max_time FROM flows WHERE devid =:d_id GROUP BY date(endts)) AS grp ON grp.max_time = flo\
ws.endts order by flows.endts limit 400;").bindparams(d_id = dev.id)
    result_end_day = ses.execute(sql_end_day)

    for row in result_end_day:
        info['end'].append(row[1])

    table = pd.DataFrame(info)
    display(table)
    
    #creates table with times for each week day
    info_week = defaultdict(list)
    if (info['start']):
        for timst in info['start']:
            day = timst
            weekday = day.strftime('%A')
            info_week[weekday].append(day)
            #print(day, day.strftime('%A'))
        #print (info_week)
        days_str = {'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday',	'Sunday'}
        for name in days_str:
            df_week = pd.DataFrame(info_week[name])
            df_week.columns = [name]
            display(df_week)

ses.close()

   devid                        end                      start
0      1 2015-03-05 13:47:02.622617 2015-03-05 10:31:16.214518
1      1 2015-03-06 16:39:06.818626 2015-03-06 14:22:11.114880
2      1 2015-03-07 23:49:01.854332 2015-03-07 10:18:58.578948
3      1 2015-03-17 23:45:08.831911 2015-03-17 20:12:04.855609
4      1 2015-03-19 23:59:57.428200 2015-03-19 01:34:56.387976
5      1 2015-03-20 00:15:32.173448 2015-03-20 00:01:01.113738
6      1 2015-03-21 23:59:46.475630 2015-03-21 08:13:44.100283
7      1 2015-03-22 00:16:23.540436 2015-03-22 00:00:15.879419
8      1 2015-03-25 00:17:01.372017 2015-03-25 00:01:57.562157
9      1 2015-03-28 22:04:24.233281 2015-03-28 22:04:24.120179
10     1 2015-03-29 20:35:41.710687 2015-03-29 00:18:01.607984
11     1 2015-04-05 23:58:55.228272 2015-04-05 00:17:54.671944
12     1 2015-04-06 23:58:51.863611 2015-04-06 00:00:04.216443
13     1 2015-04-07 23:54:33.979634 2015-04-07 00:01:34.624803
14     1 2015-04-08 00:15:09.315169 2015-04-08 00:00:06.873174
15     1 2015-04-12 19:43:16.490312 2015-04-12 19:43:16.490312
16     1 2015-04-16 22:56:49.892832 2015-04-16 22:56:49.659521
17     1 2015-04-21 21:24:20.531712 2015-04-21 21:24:20.471603
18     1 2015-05-01 22:33:59.864499 2015-05-01 22:33:59.630315
19     1 2015-05-02 22:33:54.185173 2015-05-02 01:26:47.042386
20     1 2015-05-03 01:05:13.558750 2015-05-03 01:05:13.336666
21     1 2015-06-02 23:28:15.951495 2015-06-02 23:28:15.751360
22     1 2015-06-03 21:34:28.645436 2015-06-03 21:34:28.451780
23     1 2015-06-04 22:02:58.394108 2015-06-04 22:02:58.150729

                      Monday
0 2015-04-06 00:00:04.216443

                     Tuesday
0 2015-03-17 20:12:04.855609
1 2015-04-07 00:01:34.624803
2 2015-04-21 21:24:20.471603
3 2015-06-02 23:28:15.751360

                      Friday
0 2015-03-06 14:22:11.114880
1 2015-03-20 00:01:01.113738
2 2015-05-01 22:33:59.630315

                   Wednesday
0 2015-03-25 00:01:57.562157
1 2015-04-08 00:00:06.873174
2 2015-06-03 21:34:28.451780

                    Thursday
0 2015-03-05 10:31:16.214518
1 2015-03-19 01:34:56.387976
2 2015-04-16 22:56:49.659521
3 2015-06-04 22:02:58.150729

                      Sunday
0 2015-03-22 00:00:15.879419
1 2015-03-29 00:18:01.607984
2 2015-04-05 00:17:54.671944
3 2015-04-12 19:43:16.490312
4 2015-05-03 01:05:13.336666

                    Saturday
0 2015-03-07 10:18:58.578948
1 2015-03-21 08:13:44.100283
2 2015-03-28 22:04:24.120179
3 2015-05-02 01:26:47.042386

Empty DataFrame
Columns: []
Index: []

   devid                        end                      start
0      3 2015-04-18 14:55:16.534610 2015-04-18 14:24:29.663117
1      3 2015-04-19 14:46:22.325818 2015-04-19 02:37:08.263501
2      3 2015-04-20 22:21:36.330138 2015-04-20 03:06:35.546421
3      3 2015-04-24 19:32:47.087257 2015-04-24 19:32:46.849299
4      3 2015-04-27 19:27:22.470298 2015-04-27 19:14:16.797616
5      3 2015-04-28 17:35:57.809929 2015-04-28 17:35:57.778453
6      3 2015-05-02 23:57:19.872874 2015-05-02 22:33:54.103909
7      3 2015-05-03 23:43:24.536313 2015-05-03 00:08:44.129625
8      3 2015-05-04 23:33:21.959675 2015-05-04 15:09:12.355742
9      3 2015-05-05 04:01:13.132237 2015-05-05 04:01:12.956264
10     3 2015-05-11 02:12:51.556988 2015-05-11 02:12:51.293968
11     3 2015-05-19 12:07:16.441672 2015-05-19 00:49:39.826325
12     3 2015-05-21 18:29:33.675886 2015-05-21 18:29:33.675824
13     3 2015-05-22 01:03:27.862882 2015-05-22 01:03:27.595172
14     3 2015-05-25 06:30:27.777042 2015-05-25 06:30:27.604946
15     3 2015-05-27 00:02:50.716709 2015-05-27 00:02:50.440859
16     3 2015-06-02 11:13:40.833059 2015-06-02 10:50:21.465775
17     3 2015-06-03 20:31:17.875779 2015-06-03 14:02:32.639924
18     3 2015-06-04 00:26:12.293125 2015-06-04 00:26:12.262997
19     3 2015-06-15 23:57:19.082118 2015-06-15 00:22:49.992925
20     3 2015-06-16 00:06:50.161208 2015-06-16 00:03:45.983651

                      Monday
0 2015-04-20 03:06:35.546421
1 2015-04-27 19:14:16.797616
2 2015-05-04 15:09:12.355742
3 2015-05-11 02:12:51.293968
4 2015-05-25 06:30:27.604946
5 2015-06-15 00:22:49.992925

                     Tuesday
0 2015-04-28 17:35:57.778453
1 2015-05-05 04:01:12.956264
2 2015-05-19 00:49:39.826325
3 2015-06-02 10:50:21.465775
4 2015-06-16 00:03:45.983651

                      Friday
0 2015-04-24 19:32:46.849299
1 2015-05-22 01:03:27.595172

                   Wednesday
0 2015-05-27 00:02:50.440859
1 2015-06-03 14:02:32.639924

                    Thursday
0 2015-05-21 18:29:33.675824
1 2015-06-04 00:26:12.262997

                      Sunday
0 2015-04-19 02:37:08.263501
1 2015-05-03 00:08:44.129625

                    Saturday
0 2015-04-18 14:24:29.663117
1 2015-05-02 22:33:54.103909

   devid                        end                      start
0      4 2015-03-01 21:00:18.975444 2015-03-01 07:47:31.058475
1      4 2015-03-03 09:55:16.404654 2015-03-03 06:49:27.868855
2      4 2015-03-05 23:19:28.926246 2015-03-05 00:18:02.356548
3      4 2015-03-06 23:59:43.137605 2015-03-06 09:27:49.032141
4      4 2015-03-07 16:02:46.569310 2015-03-07 00:01:03.762147
5      4 2015-03-08 00:16:53.475028 2015-03-08 00:00:23.252136
6      4 2015-03-09 21:52:18.265992 2015-03-09 07:54:28.302966
7      4 2015-03-12 21:35:21.700963 2015-03-12 00:27:59.900232
8      4 2015-03-13 09:25:09.694741 2015-03-13 09:08:49.377171
9      4 2015-03-14 23:59:39.290760 2015-03-14 23:02:44.555990
10     4 2015-03-15 00:01:00.833200 2015-03-15 00:00:20.268338
11     4 2015-03-16 22:36:12.264290 2015-03-16 07:40:51.719091
12     4 2015-03-17 22:39:56.553892 2015-03-17 07:52:49.642319
13     4 2015-03-19 22:59:31.198875 2015-03-19 22:01:12.348438
14     4 2015-03-21 13:56:32.010460 2015-03-21 08:17:15.040054
15     4 2015-03-24 22:43:33.788432 2015-03-24 07:30:10.615180
16     4 2015-03-25 22:50:31.948897 2015-03-25 22:50:31.944736
17     4 2015-03-29 23:59:56.030973 2015-03-29 20:02:10.753090
18     4 2015-03-30 00:01:44.603257 2015-03-30 00:00:05.260900
19     4 2015-04-05 18:35:35.040226 2015-04-05 00:24:21.532504
20     4 2015-04-06 16:50:34.751536 2015-04-06 09:06:25.579210
21     4 2015-04-07 23:08:18.435966 2015-04-07 08:28:34.047873
22     4 2015-06-12 10:16:21.028127 2015-06-12 00:22:20.746155

                      Monday
0 2015-03-09 07:54:28.302966
1 2015-03-16 07:40:51.719091
2 2015-03-30 00:00:05.260900
3 2015-04-06 09:06:25.579210

                     Tuesday
0 2015-03-03 06:49:27.868855
1 2015-03-17 07:52:49.642319
2 2015-03-24 07:30:10.615180
3 2015-04-07 08:28:34.047873

                      Friday
0 2015-03-06 09:27:49.032141
1 2015-03-13 09:08:49.377171
2 2015-06-12 00:22:20.746155

                   Wednesday
0 2015-03-25 22:50:31.944736

                    Thursday
0 2015-03-05 00:18:02.356548
1 2015-03-12 00:27:59.900232
2 2015-03-19 22:01:12.348438

                      Sunday
0 2015-03-01 07:47:31.058475
1 2015-03-08 00:00:23.252136
2 2015-03-15 00:00:20.268338
3 2015-03-29 20:02:10.753090
4 2015-04-05 00:24:21.532504

                    Saturday
0 2015-03-07 00:01:03.762147
1 2015-03-14 23:02:44.555990
2 2015-03-21 08:17:15.040054

   devid                        end                      start
0      5 2015-02-26 20:08:43.609554 2015-02-26 17:07:27.365762
1      5 2015-03-01 23:57:37.499950 2015-03-01 12:05:36.719980
2      5 2015-03-02 00:16:58.711643 2015-03-02 00:00:24.089288
3      5 2015-03-05 22:21:58.679227 2015-03-05 13:29:47.403232
4      5 2015-03-09 23:52:49.112035 2015-03-09 13:52:42.413849
5      5 2015-03-12 23:59:00.320442 2015-03-12 00:19:28.247003
6      5 2015-03-13 21:51:56.021490 2015-03-13 00:04:29.538558
7      5 2015-03-21 13:34:01.366030 2015-03-21 08:06:10.479144
8      5 2015-03-25 22:50:31.663430 2015-03-25 22:50:27.623807
9      5 2015-03-29 23:47:58.533565 2015-03-29 00:18:37.448983
10     5 2015-04-05 13:59:05.256199 2015-04-05 00:19:53.093316
11     5 2015-04-06 15:42:57.937014 2015-04-06 00:06:14.962294
12     5 2015-04-07 21:02:39.043050 2015-04-07 14:30:13.224144
13     5 2015-05-04 18:25:22.443287 2015-05-04 18:25:22.414759

                      Monday
0 2015-03-02 00:00:24.089288
1 2015-03-09 13:52:42.413849
2 2015-04-06 00:06:14.962294
3 2015-05-04 18:25:22.414759

                     Tuesday
0 2015-04-07 14:30:13.224144

                      Friday
0 2015-03-13 00:04:29.538558

                   Wednesday
0 2015-03-25 22:50:27.623807

                    Thursday
0 2015-02-26 17:07:27.365762
1 2015-03-05 13:29:47.403232
2 2015-03-12 00:19:28.247003

                      Sunday
0 2015-03-01 12:05:36.719980
1 2015-03-29 00:18:37.448983
2 2015-04-05 00:19:53.093316

                    Saturday
0 2015-03-21 08:06:10.479144

   devid                        end                      start
0      6 2015-03-05 23:57:41.262526 2015-03-05 21:48:08.111112
1      6 2015-03-06 23:16:28.906022 2015-03-06 00:01:33.004413
2      6 2015-03-07 23:57:04.582814 2015-03-07 11:27:27.914741
3      6 2015-03-08 00:16:09.255980 2015-03-08 00:00:09.913389
4      6 2015-03-09 22:35:46.926885 2015-03-09 18:45:06.395510
5      6 2015-03-12 23:11:25.820677 2015-03-12 10:05:48.055392
6      6 2015-03-14 22:30:12.594612 2015-03-14 13:09:53.791906
7      6 2015-03-15 15:39:36.854986 2015-03-15 14:16:15.747360
8      6 2015-03-16 23:59:59.925316 2015-03-16 19:08:00.564826
9      6 2015-03-17 23:58:21.016543 2015-03-17 00:00:00.551829
10     6 2015-03-18 00:12:38.339443 2015-03-18 00:04:59.944115
11     6 2015-03-19 23:23:05.663748 2015-03-19 15:44:32.625217
12     6 2015-03-24 19:41:31.675374 2015-03-24 14:23:50.873419
13     6 2015-03-25 22:50:35.074980 2015-03-25 19:37:58.540416
14     6 2015-03-29 23:32:53.497775 2015-03-29 13:48:57.283764
15     6 2015-04-05 23:59:31.095576 2015-04-05 00:19:32.451521
16     6 2015-04-06 01:28:25.668705 2015-04-06 00:04:51.480475
17     6 2015-04-07 22:11:34.925235 2015-04-07 15:01:02.935032
18     6 2015-04-15 21:04:56.323837 2015-04-15 21:04:56.227966

                      Monday
0 2015-03-09 18:45:06.395510
1 2015-03-16 19:08:00.564826
2 2015-04-06 00:04:51.480475

                     Tuesday
0 2015-03-17 00:00:00.551829
1 2015-03-24 14:23:50.873419
2 2015-04-07 15:01:02.935032

                      Friday
0 2015-03-06 00:01:33.004413

                   Wednesday
0 2015-03-18 00:04:59.944115
1 2015-03-25 19:37:58.540416
2 2015-04-15 21:04:56.227966

                    Thursday
0 2015-03-05 21:48:08.111112
1 2015-03-12 10:05:48.055392
2 2015-03-19 15:44:32.625217

                      Sunday
0 2015-03-08 00:00:09.913389
1 2015-03-15 14:16:15.747360
2 2015-03-29 13:48:57.283764
3 2015-04-05 00:19:32.451521

                    Saturday
0 2015-03-07 11:27:27.914741
1 2015-03-14 13:09:53.791906

   devid                        end                      start
0      7 2015-04-17 13:56:50.001647 2015-04-17 12:05:39.785996
1      7 2015-04-18 16:51:35.809425 2015-04-18 16:51:35.710050
2      7 2015-04-19 02:00:13.724087 2015-04-19 02:00:13.630175
3      7 2015-04-20 17:14:09.793142 2015-04-20 12:12:43.957630
4      7 2015-04-21 23:42:49.398819 2015-04-21 11:53:58.681012
5      7 2015-04-24 22:50:09.086345 2015-04-24 22:50:08.882422
6      7 2015-04-26 23:39:51.769809 2015-04-26 13:41:44.883979
7      7 2015-04-27 23:27:57.654809 2015-04-27 00:05:44.588717
8      7 2015-04-29 21:36:16.241351 2015-04-29 21:36:15.984598
9      7 2015-05-01 11:04:36.877418 2015-05-01 11:04:36.619340
10     7 2015-05-05 17:13:49.987819 2015-05-05 15:47:37.825994
11     7 2015-05-11 22:58:04.001374 2015-05-11 12:23:14.502085
12     7 2015-05-15 14:49:06.803449 2015-05-15 11:24:29.680890
13     7 2015-05-16 17:41:22.039685 2015-05-16 17:41:21.758416
14     7 2015-05-26 19:16:51.946806 2015-05-26 19:16:51.633431
15     7 2015-05-27 21:38:24.324724 2015-05-27 21:38:24.053702
16     7 2015-05-31 19:01:01.178758 2015-05-31 12:30:10.619849
17     7 2015-06-01 14:47:03.517120 2015-06-01 11:33:03.885880
18     7 2015-06-02 23:28:15.996657 2015-06-02 12:30:17.665093
19     7 2015-06-03 23:57:56.197431 2015-06-03 16:40:52.787676
20     7 2015-06-04 22:52:39.383781 2015-06-04 00:03:50.301703
21     7 2015-06-12 00:36:12.091708 2015-06-12 00:17:10.069828
22     7 2015-06-22 15:22:10.873550 2015-06-22 15:22:09.377370
23     7 2015-06-23 23:07:14.509817 2015-06-23 10:23:05.930214

                      Monday
0 2015-04-20 12:12:43.957630
1 2015-04-27 00:05:44.588717
2 2015-05-11 12:23:14.502085
3 2015-06-01 11:33:03.885880
4 2015-06-22 15:22:09.377370

                     Tuesday
0 2015-04-21 11:53:58.681012
1 2015-05-05 15:47:37.825994
2 2015-05-26 19:16:51.633431
3 2015-06-02 12:30:17.665093
4 2015-06-23 10:23:05.930214

                      Friday
0 2015-04-17 12:05:39.785996
1 2015-04-24 22:50:08.882422
2 2015-05-01 11:04:36.619340
3 2015-05-15 11:24:29.680890
4 2015-06-12 00:17:10.069828

                   Wednesday
0 2015-04-29 21:36:15.984598
1 2015-05-27 21:38:24.053702
2 2015-06-03 16:40:52.787676

                    Thursday
0 2015-06-04 00:03:50.301703

                      Sunday
0 2015-04-19 02:00:13.630175
1 2015-04-26 13:41:44.883979
2 2015-05-31 12:30:10.619849

                    Saturday
0 2015-04-18 16:51:35.710050
1 2015-05-16 17:41:21.758416

  devid                        end                      start
0     8 2015-04-17 13:20:12.216406 2015-04-17 13:20:12.152842
1     8 2015-04-19 23:35:08.153332 2015-04-19 23:35:08.148459

ValueError: Length mismatch: Expected axis has 0 elements, new values have 1 elements